#ifndef CRG_KALMAN_FILTER_H
#define CRG_KALMAN_FILTER_H
/*
                                                                                                                                                                    
                                                                                                                                                                                   
                         ||                  |||                                                                                              |||                   |||||||||      
                         ||           ||||||||||||||       ||||||||||||||||||        |||||||                             ||||||||      ||||||||||||||            |||||||||||||||   
                        ||||           ||||||||||||||       |||||||||||||||||      ||||||||||                          ||||||||||||     ||||||||||||||          |||||      |||||   
                        ||||             ||||   ||||||        ||||        |||     ||||   ||||                         |||||    ||||       ||||   ||||||        ||||          |||   
                        ||||             ||||    |||||        ||||         ||     |||      ||                        ||||        |||      ||||    |||||       ||||            ||   
                       ||||||            ||||     ||||        ||||         ||    ||||      ||                       ||||         |||      ||||     ||||      ||||             ||   
                       || |||            ||||     ||||        ||||               ||||      ||                      ||||           ||      ||||     ||||      ||||                  
                      ||| |||            ||||     ||||        ||||       ||       ||||                             ||||                   ||||     ||||     |||||                  
                      ||  ||||           ||||    ||||         ||||       ||       ||||||                           ||||                   ||||    ||||      ||||                   
                      ||   |||           ||||   ||||          ||||       ||        |||||||                        ||||                    ||||   ||||       ||||                   
                     |||   ||||          ||||||||||           |||||||||||||         ||||||||                      ||||                    ||||||||||        ||||                   
                     ||||||||||          ||||  ||||           |||||||||||||           |||||||                     ||||                    ||||  ||||        ||||        |||||||||||
                    |||||||||||          ||||   ||||          ||||       ||             ||||||                    ||||                    ||||   ||||       ||||        |||||||||||
                    |||     ||||         ||||   ||||          ||||       ||               ||||                    ||||                    ||||   ||||       |||||           ||||   
                    ||      ||||         ||||    ||||         ||||       ||      ||        |||                    ||||                    ||||    ||||       ||||           ||||   
                   |||       |||         ||||    |||||        ||||        |  ||  |||       |||                     ||||                   ||||    |||||      |||||          ||||   
                   ||        ||||        ||||     ||||        ||||          |||  |||       |||                     ||||           ||      ||||     ||||      |||||          ||||   
                   ||         |||        ||||     |||||       ||||          |||  ||||      |||                      ||||          ||      ||||     |||||      |||||         ||||   
                  |||         ||||       |||||     ||||||     ||||         |||   ||||||  ||||                       ||||         |||      |||||     ||||||     ||||||      |||||   
               |||||||||   |||||||||  ||||||||||   ||||||| |||||||||||||||||||    ||||||||||                         |||||     ||||    ||||||||||   |||||||      ||||||||||||||      
               |||||||||   |||||||||  ||||||||||    |||||| |||||||||||||||||||      ||||||                             ||||||||||||    ||||||||||    ||||||        |||||||||       
                                                                                                                         ||||||||                                                  
                                                                                                                                                                                   
                                                                                                ||||||||||||||||                                                                   
                                                                                                ||||||||||||||||                                                                                                                                                                   
 
*/

#include "c_data_typedef.h"

typedef struct
{
    fp32 x_f[2];//先验估算
    fp32 x_l[2];//后验估算
    fp32 U[2];//控制量
    fp32 Z[2];//测量量
    fp32 P_f[2][2];//先验协方差
    fp32 P_l[2][2];//后验协方差
    fp32 Q[2][2];  //过程噪音协方差
    fp32 R[2][2];  //测量噪音协方差
    fp32 K[2][2];  //卡尔曼增益
    fp32 A[2][2];  //状态转移矩阵
    fp32 B[2][2];  //控制矩阵
    fp32 H[2][2];  //测量矩阵
    fp32 I[2][2];  //单位矩阵
}kalman_filter_t;

/**
 * @brief kalman滤波初始化
 * @return none
 * @note 初始化不同2D模型对应的Q，R，A，B，H矩阵 初始化后验估计x_l_0，P_l_0
 * @param kalman_filter 滤波结构体指针
 * @param Q 过程噪音协方差矩阵
 * @param R 测量噪音协方差矩阵
 * @param A 状态转移矩阵
 * @param B 控制矩阵
 * @param H 测量矩阵
 * @param x_l_0 后验估计初始化
 * @param P_l_0 矫正协方差矩阵初始化
 * @author  Ares_茶荣果
 * @version 1.0
 * @date    2025-01-30
 */
extern void kalman_filter_init(kalman_filter_t *kalman_filter,fp32 Q[2][2],fp32 R[2][2],fp32 A[2][2],fp32 B[2][2],fp32 H[2][2],fp32 x_l_0[2],fp32 P_l_0[2][2]);                                                                                                                                                          


/**
 * @brief kalman滤波计算
 * @return none
 * @note 计算后验估计x_l，矫正协方差矩阵P_l,卡尔曼增益K,先验估计x_f，先验协方差矩阵P_f
 * @param kalman_filter 滤波结构体指针
 * @param z_msg 输入测量值
 * @param u_msg 输入控制量
 * @author  Ares_茶荣果
 * @version 1.0
 * @date    2025-01-30
 */
extern void kalman_filter_calc(kalman_filter_t *kalman_filter,fp32 z_msg[2],fp32 u_msg[2]);

// void kaman_filter_1d_init();    
/**
 * @brief 一维kalman滤波计算
 * @return 一维计算结果
 * @param ResrcData 输入测量值
 * @param ProcessNoise_Q    Q
 * @param MeasureNoise_R    R
 * @author  Ares_茶荣果
 * @version 1.0
 * @date    2025-03-30
 */
// extern fp32 kaman_filter_1d_calc(fp32 ResrcData,fp32 ProcessNoise_Q,fp32 MeasureNoise_R);  
#endif // CRG_KALMAN_FILTER_H
